class CharacterHelpText {
  CharacterHelpText._();

  static const name = 'Имя персонажа';

  static const concept = 'Концепт персонажа:\n'
      'Кратко опишите, кем является ваш персонаж. По концепту должно быть понятно, что речь идёт именно об этом персонаже. Это может быть профессия, роль в обществе или общее описание того, чем он занимается. Например: "Бесстрашный космический пират" или "Опытный детектив из прошлого".';

  static const description = 'Описание персонажа:\n'
      'Опишите внешний вид, манеры и основные черты вашего персонажа. Как он выглядит, как ведет себя, что делает его особенным?';

  static const skill = 'Подходы персонажа:\n'
      'Выберите значения подходов, которые описывают способности вашего персонажа. Например: "Быстрый как молния", "Мастер рукопашного боя", или "Обладатель сверхъестественной интуиции".';

  static const aspect = 'Аспекты персонажа:\n'
      'Аспекты - это ключевые элементы, которые определяют вашего персонажа. Они могут быть как положительными, так и отрицательными, и влияют на игру. Например: "Вечный оптимист", "Тёмное прошлое", "Всегда готов к драке".';

  static const stunt = 'Трюки персонажа:\n'
      'Трюки - это особые способности или уловки вашего персонажа, которые дают ему преимущество в определенных ситуациях. Например: "Захват за плечо: получаете +2 к броску на Атлетику, когда пытаетесь схватить противника".';

  static const problem = 'Проблема персонажа:\n'
      'Опишите основную проблему или слабость вашего персонажа, которая может создать ему трудности в ходе игры. Это может быть внутренний конфликт, слабость или внешняя угроза. Например: "Склонность к самоуничтожению" или "Преследуемый бандой из прошлого".';
}
