class CharacterHelpText {
  CharacterHelpText._();

  static const name = 'Как зовут персонажа?';

  static const concept =
      'Сначала определись с концепцией персонажа. Это фраза или слово, которое максимально описывает то, кем является твой персонаж. Думая о концепции, держи в голове вот что: как концепция может помочь персонажу и как она может усложнить ему жизнь. Хорошая концепция сочетает и то, и другое.\n'
      'ПРИМЕР: Опальный капитан «Небесного Первопроходца», Полевой агент ИГЕМА с посттраваматическим синдромом, Звездочет-оборотень пустыни Андрал';

  static const description =
      'Опишите внешний вид, манеры и основные черты вашего персонажа. Как он выглядит, как ведет себя, что делает его особенным?';

  static const skill =
      'Выбери свои подходы. Они описывают то, как ты предпочитаешь решать те или иные проблемы.\n'
      'У каждого подхода есть бонус. Выбери один Хороший (+3), два Уверенных (+2), два Средних (+1) и один Обычный (+0).\n'
      'Подходы могут многое сказать о персонаже. Например, если ты...\n'
      '• Варвар: Сильный +3, Аккуратныйи Эффектный +2, Хитрый и Проворный +1, Умный +0\n'
      '• Вор: Хитрый +3, Аккуратный и Проворный +2, Умный и Эффектный +1, Сильный +0\n'
      '• Звезда: Проворный +3, Сильный и Эффектный +2, Умный и Аккуратный +1, Хитрый +0\n'
      '• Пройдоха: Умный +3, Хитрый и Эффектный +2, Сильный и Проворный +1, Аккуратный +0\n'
      '• Сорвиголова: Эффектный +3, Проворный и Умный +2, Сильный и Хитрый +1, Аккуратный +0\n'
      '• Хранитель: Аккуратный +3, Сильный и Умный +2, Хитрый и Проворный +1, Эффектный +0';

  static const aspect =
      'Аспект — это слово, фраза или предложение, четко и хлестко характеризующее что-то важное для твоего персонажа. Это может быть девиз, забавная причуда, отношение к кому-то, интересная вещь или что угодно еще.\n'
      'Аспекты позволяют тебе влиять на историю там, где она затрагивает твоего персонажа, его особенности или умения. С их помощью ты можешь изменять детали мира игры, как, например, присутствие магии и волшебства, опасных злодеев или секретных организаций.\n'
      'Если хочешь, можешь придумать еще один или два дополнительных аспекта. Эти аспекты также будут описывать персонажа или его отношения с другими игровыми и неигровыми персонажами. Или это может быть еще одна интересная деталь его личности или окружения. Впрочем, если не хочешь — оставь пока их незаполненными, придумаешь по ходу игры.';

  static const stunt =
      'Трюк — это особенный талант, благодаря которому один из твоих подходов работает лучше. Как правило, трюк дает бонус +2 для определенного подхода в определенной ситуации.\n'
      'Трюки - это особые способности или уловки вашего персонажа, которые дают ему преимущество в определенных ситуациях. Например: "Захват за плечо: получаете +2 к броску Сильного подхода, когда пытаетесь схватить противника за плечо".\n'
      'Разовый тип трюков позволяет тебе сделать что-то крутое, игнорируя обычные правила. Используй этот шаблон: Я [опиши специфическую особенность персонажа], поэтому один раз за игровую встречу я могу [опиши что-то крутое, чтоты можешь сделать]. Это даёт автоматический успех трюка.';

  static const problem =
      'Что является главным источником проблем для твоего персонажа? Это может быть твоя слабость, или вечный противник, или серьезное обязательство — что угодно, что делает твою жизнь сложнее.\n'
      'ПРИМЕР: Стальной Убийца идет по моему следу, Чары есть — ума не надо, Должен присматривать за младшим братом.';
}
